# language: ja
フィーチャ: パーティの相性の詳細が見れる
  ポケモントレーナーとして
  パーティの相性の詳細が見たい

  なぜなら、本当に相性がいいかパッと見よくわからないからだ

  背景:
    前提 以下の作成済みのパーティがある:
      |   名前     | タイプ1  |
      | コラッタ   | ノーマル |
      | ラッタ     | ノーマル |
      | ポリゴン   | ノーマル |
      | ポリゴン2  | ノーマル |
      | ポリゴンZ  | ノーマル |
      | ケンタロス | ノーマル |
    かつ そのパーティの詳細画面を表示している

  シナリオ: パーティの相性の詳細が表示されている
    ならば 以下の相性表が表示されていること:
      | ノーマル | 0.0    |
      | ほのお   | 0.0    |
      | みず     | 0.0    |
      | でんき   | 0.0    |
      | くさ     | 0.0    |
      | こおり   | 0.0    |
      | かくとう | -0.6   |
      | どく     | 0.0    |
      | じめん   | 0.0    |
      | ひこう   | 0.0    |
      | エスパー | 0.0    |
      | むし     | 0.0    |
      | いわ     | 0.0    |
      | ゴースト | 1.0    |
      | ドラゴン | 0.0    |
      | あく     | 0.0    |
      | はがね   | 0.0    |
      | ようせい | 0.0    |
